Revit 2027 API
ImageBackgroundSettings Class
 Represents the rendering image background settings.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BackgroundSettings
 Autodesk.Revit.DB.ImageBackgroundSettings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ImageBackgroundSettings : BackgroundSettings
Public Class ImageBackgroundSettings
	Inherits BackgroundSettings
public ref class ImageBackgroundSettings : public BackgroundSettings
type ImageBackgroundSettings =
    class
        inherit BackgroundSettings
    end
The ImageBackgroundSettings type exposes the following members.
Properties
Name | Description
BackgroundImageFit |  The background image fit type.
FilePath |  File path of the image for the rendering background.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from BackgroundSettings)
OffsetHeight |  The vertical offset of the rendering image to the rendering region.
OffsetWidth |  The horizontal offset of the rendering image to the rendering region.
Top
Methods
Name | Description
Dispose
(Inherited from BackgroundSettings)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace